become-cool/beshell-mg/examples/beshell-mg-app/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="img/partitions-4MB.csv"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Mongoose 配置
CONFIG_MG_ENABLE_LWIP=y
